## Importing Data

In [1]:
import pandas as pd

In [2]:
main_df = pd.read_csv("train.csv")
final_df = pd.read_csv("test.csv")

In [3]:
main_df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [4]:
final_df.head(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S

In [5]:
main_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [6]:
main_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [7]:
main_df['Embarked'].describe() #Get the most common to fill out empty values

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [8]:
# main_df['Cabin'].describe() #decided not use it

In [9]:
# list(set(main_df['Cabin'].values))[:10]

In [10]:
# deck_dict = {}
# counter = 1

# for item in set(main_df['Cabin'].values):
#     if not(pd.isna(item)) and item[0] not in deck_dict:
#         deck_dict[item[0]]=counter
#         counter += 1

# deck_dict

## Preparing Data

In [11]:
def preprocess(df):
    df = df.drop(["PassengerId","Ticket","Cabin"], axis=1)
    
    mean = main_df["Age"].mean()
    for n,item in enumerate(df["Age"]):
        if pd.isna(item):
            df.at[n,"Age"] = mean
    
#     for n,item in enumerate(df["Cabin"]):
#         if pd.isna(item):
#             df.at[n,"Cabin"] = 0
#         else:
#             df.at[n,"Cabin"] = deck_dict[item[0]]

    for n,item in enumerate(df["Name"]):
        if item.split(",")[1].split(".")[0].strip(" ") == 'Mrs':
            df.at[n,"Name"] = 1
        if item.split(",")[1].split(".")[0].strip(" ") == 'Miss':
            df.at[n,"Name"] = 2
        if item.split(",")[1].split(".")[0].strip(" ") == 'Mr':
            df.at[n,"Name"] = 3    
        if item.split(",")[1].split(".")[0].strip(" ") == 'Master':
            df.at[n,"Name"] = 4
        else:
            df.at[n,"Name"] = 0
    
    for n,item in enumerate(df["Sex"]):
        if item == "male":
            df.at[n,"Sex"] = 0 #According documentation, use dt.at[row, 'collumn'] instead df['column'][row]
        elif item == "female":
            df.at[n,"Sex"] = 1
        else:
            df.at[n,"Sex"] = 2 #Just in case
            
    for n,item in enumerate(df["Embarked"]):
        if item == "S":
            df.at[n,"Embarked"] = 0
        elif item == "C":
            df.at[n,"Embarked"] = 1
        else:
            df.at[n,"Embarked"] = 2 #Fill 'Q' or missing values with 2
            
    df = df.fillna(0)
            
    return df

## Train/Test Split

In [12]:
train_df = preprocess(main_df)
train_df_feat = train_df.iloc[:,1:]
train_df_class = train_df.iloc[:,0]
train_df_feat.head(10)

   Pclass  Name  Sex        Age  SibSp  Parch     Fare  Embarked
0       3     0    0  22.000000      1      0   7.2500         0
1       1     0    1  38.000000      1      0  71.2833         1
2       3     0    1  26.000000      0      0   7.9250         0
3       1     0    1  35.000000      1      0  53.1000         0
4       3     0    0  35.000000      0      0   8.0500         0
5       3     0    0  29.699118      0      0   8.4583         2
6       1     0    0  54.000000      0      0  51.8625         0
7       3     4    0   2.000000      3      1  21.0750         0
8       3     0    1  27.000000      0      2  11.1333         0
9       2     0    1  14.000000      1      0  30.0708         1

In [13]:
train_df_feat.head(10)

   Pclass  Name  Sex        Age  SibSp  Parch     Fare  Embarked
0       3     0    0  22.000000      1      0   7.2500         0
1       1     0    1  38.000000      1      0  71.2833         1
2       3     0    1  26.000000      0      0   7.9250         0
3       1     0    1  35.000000      1      0  53.1000         0
4       3     0    0  35.000000      0      0   8.0500         0
5       3     0    0  29.699118      0      0   8.4583         2
6       1     0    0  54.000000      0      0  51.8625         0
7       3     4    0   2.000000      3      1  21.0750         0
8       3     0    1  27.000000      0      2  11.1333         0
9       2     0    1  14.000000      1      0  30.0708         1

In [14]:
train_df_class.head(10)

0    0
1    1
2    1
3    1
4    0
5    0
6    0
7    0
8    1
9    1
Name: Survived, dtype: int64

In [15]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(train_df_feat, train_df_class, test_size=0.05, random_state=101)
X_train.head(10)

     Pclass  Name  Sex        Age  SibSp  Parch     Fare  Embarked
298       1     0    0  29.699118      0      0  30.5000         0
392       3     0    0  28.000000      2      0   7.9250         0
536       1     0    0  45.000000      0      0  26.5500         0
189       3     0    0  36.000000      0      0   7.8958         0
674       2     0    0  29.699118      0      0   0.0000         0
247       2     0    1  24.000000      0      2  14.5000         0
736       3     0    1  48.000000      1      3  34.3750         0
98        2     0    1  34.000000      0      1  23.0000         0
706       2     0    1  45.000000      0      0  13.5000         0
573       3     0    1  29.699118      0      0   7.7500         2

In [16]:
y_train.head(10)

298    1
392    0
536    0
189    0
674    0
247    1
736    0
98     1
706    1
573    1
Name: Survived, dtype: int64

## Balancing Data (Over-sampling)

In [17]:
total = len(y_train)
survived = list(y_train).count(1)
        
survived_pct = survived/total
survived_pct

0.37943262411347517

In [18]:
from imblearn.over_sampling import SMOTE
sm = SMOTE(random_state=42)
X_train, y_train = sm.fit_resample(X_train, y_train)

In [19]:
total = len(y_train)
survived = list(y_train).count(1)
        
survived_pct = survived/total
survived_pct

0.5

## Scaling Data

In [20]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()
scaled_X_train = scaler.fit_transform(X_train)
scaled_X_test = scaler.transform(X_test)
scaled_X_train[:10]

array([[0.        , 0.        , 0.        , 0.39792223, 0.        ,
        0.        , 0.05953204, 0.        ],
       [1.        , 0.        , 0.        , 0.37483012, 0.25      ,
        0.        , 0.01546857, 0.        ],
       [0.        , 0.        , 0.        , 0.60587116, 0.        ,
        0.        , 0.05182215, 0.        ],
       [1.        , 0.        , 0.        , 0.48355531, 0.        ,
        0.        , 0.01541158, 0.        ],
       [0.5       , 0.        , 0.        , 0.39792223, 0.        ,
        0.        , 0.        , 0.        ],
       [0.5       , 0.        , 1.        , 0.32046752, 0.        ,
        0.33333333, 0.02830212, 0.        ],
       [1.        , 0.        , 1.        , 0.64664311, 0.125     ,
        0.5       , 0.06709553, 0.        ],
       [0.5       , 0.        , 1.        , 0.45637401, 0.        ,
        0.16666667, 0.04489301, 0.        ],
       [0.5       , 0.        , 1.        , 0.60587116, 0.        ,
        0.        , 0.02635025, 0.        ],
       [1.        , 0.        , 1.        , 0.39792223, 0.        ,
        0.        , 0.01512699, 1.        ]])

## Building Random Forest

In [21]:
from sklearn.ensemble import RandomForestClassifier

random_forest = RandomForestClassifier(n_estimators=1000, random_state=0)
random_forest.fit(scaled_X_train, y_train)

random_forest.score(scaled_X_train, y_train)

0.9847619047619047

In [22]:
prediction = random_forest.predict(scaled_X_test)
prediction[:10]

array([0, 1, 0, 1, 0, 0, 1, 0, 1, 1], dtype=int64)

In [23]:
random_forest.score(scaled_X_test, y_test)

0.8666666666666667

## Just checking the Score

In [24]:
prediction = pd.DataFrame(prediction, index=y_test.index, columns=['Predicted'])
new_df = pd.concat([y_test,prediction],axis=1)
new_df.head(10)

     Survived  Predicted
331         0          0
700         1          1
748         0          0
751         1          1
481         0          0
845         0          0
740         1          1
287         0          0
669         1          1
241         1          1

In [25]:
new_df['RESULT'] = 0

for n in new_df.index:
    new_df['RESULT'][n] = 1-abs(new_df['Survived'][n] - new_df['Predicted'][n])

new_df.head(10)

     Survived  Predicted  RESULT
331         0          0       1
700         1          1       1
748         0          0       1
751         1          1       1
481         0          0       1
845         0          0       1
740         1          1       1
287         0          0       1
669         1          1       1
241         1          1       1

In [26]:
total = len(new_df)
right = 0

for n in new_df.index:
    if new_df['RESULT'][n]:
        right += 1

average = right/total
average

0.8666666666666667

## Final Prediction

In [27]:
submission_df = preprocess(final_df)
submission_df.head(10)

   Pclass  Name  Sex   Age  SibSp  Parch     Fare  Embarked
0       3     0    0  34.5      0      0   7.8292         2
1       3     0    1  47.0      1      0   7.0000         0
2       2     0    0  62.0      0      0   9.6875         2
3       3     0    0  27.0      0      0   8.6625         0
4       3     0    1  22.0      1      1  12.2875         0
5       3     0    0  14.0      0      0   9.2250         0
6       3     0    1  30.0      0      0   7.6292         2
7       2     0    0  26.0      1      1  29.0000         0
8       3     0    1  18.0      0      0   7.2292         1
9       3     0    0  21.0      2      0  24.1500         0

In [28]:
scaled_X_final = scaler.transform(submission_df)
scaled_X_final

array([[1.        , 0.        , 0.        , ..., 0.        , 0.01528158,
        1.        ],
       [1.        , 0.        , 1.        , ..., 0.        , 0.01366309,
        0.        ],
       [0.5       , 0.        , 0.        , ..., 0.        , 0.01890874,
        1.        ],
       ...,
       [1.        , 0.        , 0.        , ..., 0.        , 0.01415106,
        0.        ],
       [1.        , 0.        , 0.        , ..., 0.        , 0.01571255,
        0.        ],
       [1.        , 1.        , 0.        , ..., 0.16666667, 0.0436405 ,
        0.5       ]])

In [29]:
final_prediction = random_forest.predict(scaled_X_final)
final_prediction

array([0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1,
       1, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0,
       1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1,
       0, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1,
       1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0,
       0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0,
       1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1],
      dtype=int64)

In [30]:
final = pd.concat([final_df['PassengerId'],pd.DataFrame(final_prediction, columns=['Survived'])], axis=1)
final

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         1
4            896         0
5            897         0
6            898         0
7            899         0
8            900         1
9            901         0
10           902         0
11           903         0
12           904         1
13           905         0
14           906         1
15           907         1
16           908         0
17           909         1
18           910         0
19           911         0
20           912         1
21           913         1
22           914         1
23           915         1
24           916         1
25           917         0
26           918         1
27           919         1
28           920         1
29           921         0
..           ...       ...
388         1280         0
389         1281         0
390         1282         0
391         1283         1
392         1284         1
393         1285         0
394         1286         0
395         1287         1
396         1288         0
397         1289         1
398         1290         0
399         1291         0
400         1292         1
401         1293         0
402         1294         1
403         1295         0
404         1296         0
405         1297         1
406         1298         0
407         1299         0
408         1300         1
409         1301         1
410         1302         1
411         1303         1
412         1304         0
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         1

[418 rows x 2 columns]

In [31]:
with open('submission.csv','w') as csv_file:
    csv_file.write('PassengerId,Survived\n')
    
    for index,row in final.iterrows():
        text = str(row['PassengerId'])+','+str(row['Survived'])
        csv_file.write(text)
        csv_file.write('\n')